src/InformationRegisters/УдалениеСостоянийЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>УдалениеСостоянийЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолученоСайтом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработкиСайтом</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСообщенияОтправленного</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АктРассмотренияВозврата</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаявкиПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/УдалениеСостоянийЗаявок/Ext/ManagerModule.bsl
Процедура ДобавитьДанныеУдаленияСостоянийСтрокЗаявок(Список, НомерСообщения, СтруктураХранения) Экспорт
	лКлючАлгоритма = "РегистрСведений_УдалениеСостоянийЗаявок_МодульМенеджера_ДобавитьДанныеУдаленияСостоянийСтрокЗаявок";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	ОтборЗаявок = Новый Массив;
	ОтборЗаявокРозница = новый Массив;
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип(ОбменССайтомСервер.ПространствоИмен(), "УдалениеОбъекта");
	Выборка = ВыборкаУдаленыхДокументовИстории();
	
	Пока Выборка.Следующий() Цикл
		                                                           
		ОбъектXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
		ОбъектXDTO.ТипОбъекта = "ИсторияСтрокЗаявок";
		ОбъектXDTO.Ссылка  = Выборка.Документ.УникальныйИдентификатор();
		Список.Добавить(ОбъектXDTO);
		
		ОтметитьВыгрузкуНаСайт(Выборка.Документ,НомерСообщения);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтметитьВыгрузкуНаСайт(Документ,НомерСообщения)
	ЗаписьУдаления = РегистрыСведений.УдалениеСостоянийЗаявок.СоздатьМенеджерЗаписи();
	ЗаписьУдаления.Документ = Документ;
	ЗаписьУдаления.ПолученоСайтом = Истина;
	ЗаписьУдаления.ДатаОбработкиСайтом = ТекущаяДата();
	ЗаписьУдаления.НомерСообщенияОтправленного = НомерСообщения;
	ЗаписьУдаления.Записать();
КонецПроцедуры

Функция ВыборкаУдаленыхДокументовИстории()
	КоличествоОбъектов = РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен (Общее)","Количество объектов в обмене", 1000);	
	
	ЗапросУдаленых  = новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ Первые %1
	|	УдалениеСостоянийЗаявок.Документ
	|ИЗ
	|	РегистрСведений.УдалениеСостоянийЗаявок КАК УдалениеСостоянийЗаявок
	|ГДЕ
	|	УдалениеСостоянийЗаявок.ПолученоСайтом = ЛОЖЬ";
	
	ЗапросУдаленых.Текст  = СтрШаблон(ТекстЗапроса,Формат(КоличествоОбъектов, "ЧГ="));
	
	Возврат ЗапросУдаленых.Выполнить().Выбрать();

КонецФункции
